#    -*- mode: org -*-


***** COMMENT System environment parameter.
   #+begin_src elisp
  (setenv "JULIA_HISTORY"  ".julia_history")
  (setenv "JULIA_ANSWER_COLOR" "blue")
  (setenv "JULIA_NUM_THREADS" "3")
   #+end_src

   #+RESULTS:
   : 3
*** Hot expand defun
#+BEGIN_SRC elisp
(defun hot-expand (str &optional mod header)
  "Expand org block template.

    STR is a structure template string recognised by org like <s. MOD is a
    string with additional parameters to add the begin line of the
    structure element. HEADER string includes more parameters that are
    prepended to the element after the #+HEADERS: tag."
  (let ((-str (if mod (concat str " " mod) str)))
    (if (region-active-p)
        (let ((-str-region (buffer-substring (region-beginning) (region-end))))
          (when header
            (delete-region (region-beginning) (region-end))
            (deactivate-mark)
            (insert "#+HEADERS: " header "\n")
            (push-mark)
            (activate-mark t)
            (insert -str-region))
          (org-insert-structure-template -str))
      (when header (insert "#+HEADERS: " header "\n"))
      (org-insert-structure-template -str)
      (insert "\n")
      (backward-char 1))))

;; (setq org-structure-template-alist (eval (car (get 'org-structure-template-alist 'standard-value))))
;; (require 'org-tempo) ; Required from org 9 onwards for old template expansion
;; Reset the org-template expnsion system, this is need after upgrading to org 9 for some reason

(defun brust-org< nil
  "Self insert command or expand hydra of org block templates
  at the beginning of a line
  or with region active."
  (interactive)
  (if (or (region-active-p) (looking-back "^"))
      (hydra-org-block-template/body)
    (self-insert-command 1)))
#+END_SRC

#+RESULTS:
: brust-org<

